; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v3 - type_2)
 	      (pred_2 ?v4 - object ?v3 - type_2)
	      (pred_1 ?v1 - type_1 ?v7 - type_3)
	      (pred_4 ?v1 - type_1 ?v4 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v6 - type_2)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v6)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v8 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v8) (pred_3 ?v1 ?v8) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v8)) 
		    (not (pred_1 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_1 ?v5 - object ?v8 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v7) (pred_3 ?v1 ?v8))
       :effect (and (pred_2 ?v5 ?v8)
		    (pred_1 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_08 - type_1
obj_03 obj_13 obj_06 obj_07 - type_3
obj_10 obj_05 obj_02 obj_12 - type_2
obj_14 obj_11 obj_09 obj_04 - object)
(:init
(pred_3 obj_01 obj_10)
(pred_1 obj_01 obj_03)
(pred_1 obj_01 obj_13)
(pred_3 obj_08 obj_05)
(pred_1 obj_08 obj_06)
(pred_1 obj_08 obj_07)
(pred_2 obj_14 obj_02)
(pred_2 obj_11 obj_10)
(pred_2 obj_09 obj_02)
(pred_2 obj_04 obj_12)
)
(:goal
(and
(pred_2 obj_14 obj_10)
(pred_2 obj_11 obj_10)
(pred_2 obj_09 obj_02)
(pred_2 obj_04 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_02)))
)
)

; plan
1. (op_3 obj_01 obj_10 obj_12)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_12)
   goals met: 2 of 4
2. (op_3 obj_08 obj_05 obj_12)
   deleted: (pred_3 obj_08 obj_05)
   added: (pred_3 obj_08 obj_12)
   goals met: 2 of 4
3. (op_2 obj_01 obj_04 obj_12 obj_13)
   deleted: (pred_2 obj_04 obj_12) (pred_1 obj_01 obj_13)
   added: (pred_4 obj_01 obj_04 obj_13)
   goals met: 2 of 4
4. (op_3 obj_08 obj_12 obj_02)
   deleted: (pred_3 obj_08 obj_12)
   added: (pred_3 obj_08 obj_02)
   goals met: 2 of 4
5. (op_3 obj_01 obj_12 obj_10)
   deleted: (pred_3 obj_01 obj_12)
   added: (pred_3 obj_01 obj_10)
   goals met: 2 of 4
6. (op_2 obj_08 obj_14 obj_02 obj_07)
   deleted: (pred_2 obj_14 obj_02) (pred_1 obj_08 obj_07)
   added: (pred_4 obj_08 obj_14 obj_07)
   goals met: 2 of 4
7. (op_3 obj_08 obj_02 obj_10)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_10)
   goals met: 2 of 4
8. (op_1 obj_01 obj_04 obj_10 obj_13)
   deleted: (pred_4 obj_01 obj_04 obj_13)
   added: (pred_2 obj_04 obj_10) (pred_1 obj_01 obj_13)
   goals met: 3 of 4
9. (op_1 obj_08 obj_14 obj_10 obj_07)
   deleted: (pred_4 obj_08 obj_14 obj_07)
   added: (pred_2 obj_14 obj_10) (pred_1 obj_08 obj_07)
   goals met: 4 of 4
